WebServiceAggregationMFP/SampleInputMessage2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
 	xmlns:c="http://www.acmeOrders.com/OrderService"
 	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<c:OrderMessage>
			<localElement>
				<FirstName>Bill</FirstName>
				<LastName>Smith</LastName>
				<Street>Low Street</Street>
				<City>London</City>
				<ZipCode>W1A1AA</ZipCode>
				<PartNumber>ABC1235</PartNumber>
				<Quantity>2</Quantity>
			</localElement>
		</c:OrderMessage>
	</soap:Body>
</soap:Envelope>
